app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "test post"], ["created_at", Wed, 25 Apr 2012 00:55:56 UTC +00:00], ["updated_at", Wed, 25 Apr 2012 00:55:56 UTC +00:00], ["user_id", 1]]
---
	def create
		@micropost = current_user.microposts.build(params[:micropost])
		if @micropost.save