app/controllers/users_controller.rb

	def show
		@user = User.find(params[:id])
		@microposts = @user.microposts.paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = 1 ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 1

	def create
		if !signed_in?
			@user = User.new(params[:user])
			if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

	def update
		if @user.update_attributes(params[:user])
---
UPDATE "users" SET "name" = 'New Name', "email" = 'new@example.com', "password_digest" = '$2a$04$Mgm3F2KDYIWY1qoCiAWraePpl8eYV9BYJ36gaC2OQ3MWTTLm4cofG', "remember_token" = '_-d9nJ8_7NYmjhn5siv5NA', "updated_at" = '2012-04-16 04:57:24.640766' WHERE "users"."id" = 1

	def destroy
		#only admins can delete, and they can't delete themselves
		user = User.find(params[:id])
		if current_user != user
			user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]